name: "ner_bert"
platform: "onnxruntime_onnx"
max_batch_size : 8

input [
    {
        name: "input_ids",
        data_type: TYPE_INT64,
        dims: [-1]   
    },
    {
        name: "attention_mask",
        data_type: TYPE_INT64,
        dims: [-1]
    },
    {
        name: "token_type_ids"
        data_type: TYPE_INT64,
        dims: [-1]
    }
]

output [
    {
        name: "logits",
        data_type: TYPE_FP32,
        dims: [-1, 13]
    }
]

# Optimization
instance_group [ {
     count: 2
     kind: KIND_CPU
}]

model_warmup: [{
    name: "bert_ner"
    batch_size: 1
    inputs: {
        key: "input_ids"
        value: {
            data_type: TYPE_INT64
            dims: 512
            zero_data: true
        }
    }
    inputs: {
        key: "attention_mask"
        value: {
            data_type: TYPE_INT64
            dims: 512
            zero_data: true
        }
    }
    inputs: {
        key: "token_type_ids"
        value: {
            data_type: TYPE_INT64
            dims: 512
            zero_data: true
        }
    }
}]